In [71]:
import pandas as pd

In [72]:
simple_dict={"Name" : ["Shanthi","Sneha","Samsu","Rekha","Supritha","Prasad"],
             "Marks": [99,87,99,76,87,34]}

simple_dict

{'Name': ['Shanthi', 'Sneha', 'Samsu', 'Rekha', 'Supritha', 'Prasad'],
 'Marks': [99, 87, 99, 76, 87, 34]}

In [73]:
type(simple_dict)

dict

In [74]:
df=pd.DataFrame(simple_dict)
df

       Name  Marks
0   Shanthi     99
1     Sneha     87
2     Samsu     99
3     Rekha     76
4  Supritha     87
5    Prasad     34

In [75]:
type(df)

pandas.core.frame.DataFrame

In [76]:
df.describe()

           Marks
count   6.000000
mean   80.333333
std    24.295404
min    34.000000
25%    78.750000
50%    87.000000
75%    96.000000
max    99.000000

In [77]:
df.shape

(6, 2)

In [78]:
df

       Name  Marks
0   Shanthi     99
1     Sneha     87
2     Samsu     99
3     Rekha     76
4  Supritha     87
5    Prasad     34

In [79]:
df.set_index("Name")

          Marks
Name
Shanthi      99
Sneha        87
Samsu        99
Rekha        76
Supritha     87
Prasad       34

In [80]:
df

       Name  Marks
0   Shanthi     99
1     Sneha     87
2     Samsu     99
3     Rekha     76
4  Supritha     87
5    Prasad     34

In [81]:
my_index=[11,12,13,14,15,16]

df=pd.DataFrame(simple_dict,index=my_index)
df

        Name  Marks
11   Shanthi     99
12     Sneha     87
13     Samsu     99
14     Rekha     76
15  Supritha     87
16    Prasad     34

In [82]:
df

        Name  Marks
11   Shanthi     99
12     Sneha     87
13     Samsu     99
14     Rekha     76
15  Supritha     87
16    Prasad     34

In [83]:
simple_dict={"Name" : ["Shanthi","Sneha","Samsu","Rekha","Supritha","Prasad"],
             "Marks": [99,87,None,76,None,34]}

In [84]:
simple_dict

{'Name': ['Shanthi', 'Sneha', 'Samsu', 'Rekha', 'Supritha', 'Prasad'],
 'Marks': [99, 87, None, 76, None, 34]}

In [85]:
df=pd.DataFrame(simple_dict,index=my_index)
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu    NaN
14     Rekha   76.0
15  Supritha    NaN
16    Prasad   34.0

In [86]:
df["Name"]

11     Shanthi
12       Sneha
13       Samsu
14       Rekha
15    Supritha
16      Prasad
Name: Name, dtype: object

In [87]:
df["Marks"]

11    99.0
12    87.0
13     NaN
14    76.0
15     NaN
16    34.0
Name: Marks, dtype: float64

In [88]:
df["Marks"].mean()

74.0

In [89]:
df["Marks"].median()

81.5

In [90]:
df["Marks"].mode()

0    34.0
1    76.0
2    87.0
3    99.0
dtype: float64

In [91]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu    NaN
14     Rekha   76.0
15  Supritha    NaN
16    Prasad   34.0

In [92]:
df.dropna()

       Name  Marks
11  Shanthi   99.0
12    Sneha   87.0
14    Rekha   76.0
16   Prasad   34.0

In [93]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu    NaN
14     Rekha   76.0
15  Supritha    NaN
16    Prasad   34.0

In [94]:
df.fillna(df["Marks"].median())

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [95]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu    NaN
14     Rekha   76.0
15  Supritha    NaN
16    Prasad   34.0

In [96]:
df.fillna(df["Marks"].median(),inplace=True)

In [97]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [98]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [99]:
df.loc[:,"Name"]

11     Shanthi
12       Sneha
13       Samsu
14       Rekha
15    Supritha
16      Prasad
Name: Name, dtype: object

In [100]:
df.loc[11:15,"Name"]

11     Shanthi
12       Sneha
13       Samsu
14       Rekha
15    Supritha
Name: Name, dtype: object

In [101]:
df.loc[11:13,["Name","Marks"]]

       Name  Marks
11  Shanthi   99.0
12    Sneha   87.0
13    Samsu   81.5

In [102]:
df.loc[:,["Name","Marks"]]

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [103]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [104]:
df.iloc[3,[0,1]]

Name     Rekha
Marks       76
Name: 14, dtype: object

In [105]:
df.iloc[3,1]

76.0

In [106]:
df

        Name  Marks
11   Shanthi   99.0
12     Sneha   87.0
13     Samsu   81.5
14     Rekha   76.0
15  Supritha   81.5
16    Prasad   34.0

In [107]:
df.to_csv("shanthicsvfile.csv")

In [108]:
df=pd.read_csv("auto-mpg.csv")

In [109]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [110]:
df.shape

(398, 9)

In [111]:
df.describe()

,mpg,cylinders,displacement,weight,acceleration,model year,origin
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [112]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [113]:
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [114]:
df.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190,3850,8.5,70,1,amc ambassador dpl

In [115]:
pd.__version__

'1.0.5'

# Series

In [116]:
simple_list=["Shanthi","Samsu","Rekha","Sneha"]
type(simple_list)

list

In [117]:
sr=pd.Series(simple_list)

In [118]:
sr

0    Shanthi
1      Samsu
2      Rekha
3      Sneha
dtype: object

In [119]:
type(sr)

pandas.core.series.Series

In [120]:
sr[0]

'Shanthi'

In [121]:
sr[1]

'Samsu'

In [122]:
my_index=[11,22,33,44]
sr=pd.Series(simple_list,index=my_index)

In [123]:
sr

11    Shanthi
22      Samsu
33      Rekha
44      Sneha
dtype: object

In [124]:

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

myvar

day1    420
day2    380
day3    390
dtype: int64

In [125]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [126]:
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [127]:
df.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190,3850,8.5,70,1,amc ambassador dpl

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [133]:
simple_dict={"Name" : ["Shanthi","Sneha","Sneha","Samsu","Rekha","Supritha","Prasad"],
             "Marks": [99,87,87,99,76,89,34]}

In [134]:
simple_dict

{'Name': ['Shanthi', 'Sneha', 'Sneha', 'Samsu', 'Rekha', 'Supritha', 'Prasad'],
 'Marks': [99, 87, 87, 99, 76, 89, 34]}

In [135]:
df=pd.DataFrame(simple_dict)
df

       Name  Marks
0   Shanthi     99
1     Sneha     87
2     Sneha     87
3     Samsu     99
4     Rekha     76
5  Supritha     89
6    Prasad     34

In [136]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [137]:
df.drop_duplicates()

       Name  Marks
0   Shanthi     99
1     Sneha     87
3     Samsu     99
4     Rekha     76
5  Supritha     89
6    Prasad     34